app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC
---
  def index
    @categories = Category.order(:name)

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT COUNT(*) FROM `categories`
---
  def new
    @count = Category.count

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('sdf', '2023-01-16 19:38:09.739847', '2023-01-16 19:38:09.739847')
---
  def create
    @category = Category.new(categories_params)
    if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 8 LIMIT 1
UPDATE `categories` SET `categories`.`name` = 'Daily', `categories`.`updated_at` = '2023-01-16 19:39:17.547093' WHERE `categories`.`id` = 8
---
  def update
    @category = Category.find(params[:id])
    if @category.update(task_params)

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 7 LIMIT 1
---
  def delete
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 1
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy