app/controllers/trees_controller.rb

SELECT `trees`.* FROM `trees`
---
  def index
    @trees = Tree.all